minhchung/k6-load-test-result.txt
KTTKPM_W9\Space-Based-Architecture\k6-tests> cat load-test.js | docker run --rm -i grafana/k6 run -

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m15s max duration (incl. graceful stop):
              * ramp_up: Up to 200 looping VUs for 1m10s over 4 stages (gracefulRampDown: 5s, gracefulStop: 30s)


running (0m01.0s), 004/200 VUs, 0 complete and 0 interrupted iterations
ramp_up   [   1% ] 004/200 VUs  0m01.0s/1m10.0s

.
.
.

running (1m12.0s), 002/200 VUs, 2762 complete and 0 interrupted iterations
ramp_up ↓ [ 100% ] 029/200 VUs  1m10s
time="2026-05-09T12:35:32Z" level=info msg="\n========================================" source=console
time="2026-05-09T12:35:32Z" level=info msg="  ??? FLASH SALE - Load Test Summary" source=console
time="2026-05-09T12:35:32Z" level=info msg="========================================" source=console
time="2026-05-09T12:35:32Z" level=info msg="  ??? FLASH SALE - K6 Load Test Results: " source=console
time="2026-05-09T12:35:32Z" level=info msg="  ---: " source=console
time="2026-05-09T12:35:32Z" level=info msg="  Total Requests: 16584" source=console
time="2026-05-09T12:35:32Z" level=info msg="  Avg Response Time: 2.05ms" source=console
time="2026-05-09T12:35:32Z" level=info msg="  p95 Response Time: 3.60ms" source=console
time="2026-05-09T12:35:32Z" level=info msg="  Checkout Success: 415" source=console
time="2026-05-09T12:35:32Z" level=info msg="  Checkout Fail: 2349" source=console
time="2026-05-09T12:35:32Z" level=info msg="========================================\n" source=console
     █ 1. Load Products

       ✓ products: status 200
       ✓ products: has data

     █ 2. View Product Detail

       ✓ detail: status 200
       ✓ detail: has product

     █ 3. Check Stock

       ✓ stock: status 200
       ✓ stock: has value

     █ 4. Add to Cart

       ✓ cart add: status 200
       ✓ cart add: item added

     █ 5. View Cart

       ✓ cart: status 200
       ✓ cart: has items

     █ 6. Checkout

       ✗ checkout: status 200
        ↳  15% — ✓ 415 / ✗ 2349
       ✗ checkout: order created
        ↳  15% — ✓ 415 / ✗ 2349

     cart_add_time..................: avg=3.176303 min=2.099673 med=3.041203 max=27.132862 p(90)=3.672884 p(95)=3.946927
     checkout_fail..................: 2349   32.500495/s
     checkout_success...............: 415    5.741893/s
   ✓ checkout_time..................: avg=2.68662  min=1.420831 med=2.238262 max=20.182023 p(90)=4.325636 p(95)=4.718648
     checks.........................: 85.83% ✓ 28470      ✗ 4698
     data_received..................: 12 MB  161 kB/s
     data_sent......................: 2.2 MB 31 kB/s
   ✗ errors.........................: 21.24% ✓ 2349       ✗ 8707
     group_duration.................: avg=2.27ms   min=791.69µs med=2.01ms   max=28.12ms   p(90)=3.47ms   p(95)=4.06ms
     http_req_blocked...............: avg=90.33µs  min=2.3µs    med=4.77µs   max=26.17ms   p(90)=7.54µs   p(95)=53.77µs
     http_req_connecting............: avg=80.45µs  min=0s       med=0s       max=26.08ms   p(90)=0s       p(95)=0s
   ✓ http_req_duration..............: avg=2.05ms   min=681.92µs med=1.84ms   max=27.13ms   p(90)=3.15ms   p(95)=3.6ms
       { expected_response:true }...: avg=1.99ms   min=681.92µs med=1.74ms   max=27.13ms   p(90)=3.22ms   p(95)=3.66ms
   ✗ http_req_failed................: 14.16% ✓ 2349       ✗ 14235
     http_req_receiving.............: avg=55.51µs  min=12.94µs  med=49.85µs  max=578.99µs  p(90)=84.7µs   p(95)=100.45µs
     http_req_sending...............: avg=25.68µs  min=4.77µs   med=23.53µs  max=696.57µs  p(90)=41.84µs  p(95)=60.07µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s        p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=1.96ms   min=605.61µs med=1.76ms   max=27.07ms   p(90)=3.07ms   p(95)=3.5ms
     http_reqs......................: 16584  229.454327/s
     iteration_duration.............: avg=2.71s    min=2.71s    med=2.71s    max=2.75s     p(90)=2.72s    p(95)=2.72s
     iterations.....................: 2764   38.242388/s
   ✓ product_load_time..............: avg=1.129825 min=0.681928 med=1.070763 max=5.591232  p(90)=1.448108 p(95)=1.584813
     vus............................: 2      min=2        max=199
     vus_max........................: 200    min=200      max=200
running (1m12.3s), 000/200 VUs, 2764 complete and 0 interrupted iterations
ramp_up ✓ [ 100% ] 000/200 VUs  1m10s
time="2026-05-09T12:35:32Z" level=error msg="thresholds on metrics 'errors, http_req_failed' have been crossed"