minhchung/k6-spike-test-result.txt
KTTKPM_W9\Space-Based-Architecture\k6-tests> cat .\spike-test.js | docker run --rm -i grafana/k6 run -

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 53s max duration (incl. graceful stop):
              * spike: Up to 500 looping VUs for 23s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 004/500 VUs, 15 complete and 0 interrupted iterations
spike   [   4% ] 004/500 VUs  01.0s/23.0s

.
.
.

running (22.9s), 001/500 VUs, 22114 complete and 0 interrupted iterations
spike   [ 100% ] 001/500 VUs  23.0s/23.0s


  █ THRESHOLDS

    http_req_duration
    ✓ 'p(95)<2000' p(95)=162.64ms

    http_req_failed
    ✗ 'rate<0.15' rate=33.33%


  █ TOTAL RESULTS

    checks_total.......: 66348   2875.570338/s
    checks_succeeded...: 100.00% 66348 out of 66348
    checks_failed......: 0.00%   0 out of 66348

    ✓ view OK
    ✓ cart OK
    ✓ checkout OK

    CUSTOM
    errors.........................: 0.00%  0 out of 66348

    HTTP
    http_req_duration..............: avg=66.14ms  min=1.39ms   med=55.53ms  max=244.24ms p(90)=138.36ms p(95)=162.64ms
      { expected_response:true }...: avg=62.19ms  min=1.43ms   med=41.39ms  max=240.21ms p(90)=144.82ms p(95)=166.89ms
    http_req_failed................: 33.33% 22116 out of 66348
    http_reqs......................: 66348  2875.570338/s

    EXECUTION
    iteration_duration.............: avg=299.42ms min=105.57ms med=317.83ms max=600.6ms  p(90)=389.74ms p(95)=406.84ms
    iterations.....................: 22116  958.523446/s
    vus............................: 1      min=1              max=500
    vus_max........................: 500    min=500            max=500

    NETWORK
    data_received..................: 30 MB  1.3 MB/s
    data_sent......................: 11 MB  495 kB/s



running (23.1s), 000/500 VUs, 22116 complete and 0 interrupted iterations
spike ✓ [ 100% ] 000/500 VUs  23s
time="2026-05-09T12:39:06Z" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"